espressif/esp-idf/components/soc/esp32/register/soc/sdio_slc_reg.h
#define SLC_1INT_CLR_REG          (DR_REG_SLC_BASE + 0x20)
/* SLC_SLC1_TX_ERR_EOF_INT_CLR : WO ;bitpos:[24] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TX_ERR_EOF_INT_CLR  (BIT(24))
#define SLC_SLC1_TX_ERR_EOF_INT_CLR_M  (BIT(24))
#define SLC_SLC1_TX_ERR_EOF_INT_CLR_V  0x1
#define SLC_SLC1_TX_ERR_EOF_INT_CLR_S  24
/* SLC_SLC1_WR_RETRY_DONE_INT_CLR : WO ;bitpos:[23] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_WR_RETRY_DONE_INT_CLR  (BIT(23))
#define SLC_SLC1_WR_RETRY_DONE_INT_CLR_M  (BIT(23))
#define SLC_SLC1_WR_RETRY_DONE_INT_CLR_V  0x1
#define SLC_SLC1_WR_RETRY_DONE_INT_CLR_S  23
/* SLC_SLC1_HOST_RD_ACK_INT_CLR : WO ;bitpos:[22] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_HOST_RD_ACK_INT_CLR  (BIT(22))
#define SLC_SLC1_HOST_RD_ACK_INT_CLR_M  (BIT(22))
#define SLC_SLC1_HOST_RD_ACK_INT_CLR_V  0x1
#define SLC_SLC1_HOST_RD_ACK_INT_CLR_S  22
/* SLC_SLC1_TX_DSCR_EMPTY_INT_CLR : WO ;bitpos:[21] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TX_DSCR_EMPTY_INT_CLR  (BIT(21))
#define SLC_SLC1_TX_DSCR_EMPTY_INT_CLR_M  (BIT(21))
#define SLC_SLC1_TX_DSCR_EMPTY_INT_CLR_V  0x1
#define SLC_SLC1_TX_DSCR_EMPTY_INT_CLR_S  21
/* SLC_SLC1_RX_DSCR_ERR_INT_CLR : WO ;bitpos:[20] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_RX_DSCR_ERR_INT_CLR  (BIT(20))
#define SLC_SLC1_RX_DSCR_ERR_INT_CLR_M  (BIT(20))
#define SLC_SLC1_RX_DSCR_ERR_INT_CLR_V  0x1
#define SLC_SLC1_RX_DSCR_ERR_INT_CLR_S  20
/* SLC_SLC1_TX_DSCR_ERR_INT_CLR : WO ;bitpos:[19] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TX_DSCR_ERR_INT_CLR  (BIT(19))
#define SLC_SLC1_TX_DSCR_ERR_INT_CLR_M  (BIT(19))
#define SLC_SLC1_TX_DSCR_ERR_INT_CLR_V  0x1
#define SLC_SLC1_TX_DSCR_ERR_INT_CLR_S  19
/* SLC_SLC1_TOHOST_INT_CLR : WO ;bitpos:[18] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TOHOST_INT_CLR  (BIT(18))
#define SLC_SLC1_TOHOST_INT_CLR_M  (BIT(18))
#define SLC_SLC1_TOHOST_INT_CLR_V  0x1
#define SLC_SLC1_TOHOST_INT_CLR_S  18
/* SLC_SLC1_RX_EOF_INT_CLR : WO ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_RX_EOF_INT_CLR  (BIT(17))
#define SLC_SLC1_RX_EOF_INT_CLR_M  (BIT(17))
#define SLC_SLC1_RX_EOF_INT_CLR_V  0x1
#define SLC_SLC1_RX_EOF_INT_CLR_S  17
/* SLC_SLC1_RX_DONE_INT_CLR : WO ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_RX_DONE_INT_CLR  (BIT(16))
#define SLC_SLC1_RX_DONE_INT_CLR_M  (BIT(16))
#define SLC_SLC1_RX_DONE_INT_CLR_V  0x1
#define SLC_SLC1_RX_DONE_INT_CLR_S  16
/* SLC_SLC1_TX_SUC_EOF_INT_CLR : WO ;bitpos:[15] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TX_SUC_EOF_INT_CLR  (BIT(15))
#define SLC_SLC1_TX_SUC_EOF_INT_CLR_M  (BIT(15))
#define SLC_SLC1_TX_SUC_EOF_INT_CLR_V  0x1
#define SLC_SLC1_TX_SUC_EOF_INT_CLR_S  15
/* SLC_SLC1_TX_DONE_INT_CLR : WO ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TX_DONE_INT_CLR  (BIT(14))
#define SLC_SLC1_TX_DONE_INT_CLR_M  (BIT(14))
#define SLC_SLC1_TX_DONE_INT_CLR_V  0x1
#define SLC_SLC1_TX_DONE_INT_CLR_S  14
/* SLC_SLC1_TOKEN1_1TO0_INT_CLR : WO ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TOKEN1_1TO0_INT_CLR  (BIT(13))
#define SLC_SLC1_TOKEN1_1TO0_INT_CLR_M  (BIT(13))
#define SLC_SLC1_TOKEN1_1TO0_INT_CLR_V  0x1
#define SLC_SLC1_TOKEN1_1TO0_INT_CLR_S  13
/* SLC_SLC1_TOKEN0_1TO0_INT_CLR : WO ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TOKEN0_1TO0_INT_CLR  (BIT(12))
#define SLC_SLC1_TOKEN0_1TO0_INT_CLR_M  (BIT(12))
#define SLC_SLC1_TOKEN0_1TO0_INT_CLR_V  0x1
#define SLC_SLC1_TOKEN0_1TO0_INT_CLR_S  12
/* SLC_SLC1_TX_OVF_INT_CLR : WO ;bitpos:[11] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TX_OVF_INT_CLR  (BIT(11))
#define SLC_SLC1_TX_OVF_INT_CLR_M  (BIT(11))
#define SLC_SLC1_TX_OVF_INT_CLR_V  0x1
#define SLC_SLC1_TX_OVF_INT_CLR_S  11
/* SLC_SLC1_RX_UDF_INT_CLR : WO ;bitpos:[10] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_RX_UDF_INT_CLR  (BIT(10))
#define SLC_SLC1_RX_UDF_INT_CLR_M  (BIT(10))
#define SLC_SLC1_RX_UDF_INT_CLR_V  0x1
#define SLC_SLC1_RX_UDF_INT_CLR_S  10
/* SLC_SLC1_TX_START_INT_CLR : WO ;bitpos:[9] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TX_START_INT_CLR  (BIT(9))
#define SLC_SLC1_TX_START_INT_CLR_M  (BIT(9))
#define SLC_SLC1_TX_START_INT_CLR_V  0x1
#define SLC_SLC1_TX_START_INT_CLR_S  9
/* SLC_SLC1_RX_START_INT_CLR : WO ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_RX_START_INT_CLR  (BIT(8))
#define SLC_SLC1_RX_START_INT_CLR_M  (BIT(8))
#define SLC_SLC1_RX_START_INT_CLR_V  0x1
#define SLC_SLC1_RX_START_INT_CLR_S  8
/* SLC_FRHOST_BIT15_INT_CLR : WO ;bitpos:[7] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT15_INT_CLR  (BIT(7))
#define SLC_FRHOST_BIT15_INT_CLR_M  (BIT(7))
#define SLC_FRHOST_BIT15_INT_CLR_V  0x1
#define SLC_FRHOST_BIT15_INT_CLR_S  7
/* SLC_FRHOST_BIT14_INT_CLR : WO ;bitpos:[6] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT14_INT_CLR  (BIT(6))
#define SLC_FRHOST_BIT14_INT_CLR_M  (BIT(6))
#define SLC_FRHOST_BIT14_INT_CLR_V  0x1
#define SLC_FRHOST_BIT14_INT_CLR_S  6
/* SLC_FRHOST_BIT13_INT_CLR : WO ;bitpos:[5] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT13_INT_CLR  (BIT(5))
#define SLC_FRHOST_BIT13_INT_CLR_M  (BIT(5))
#define SLC_FRHOST_BIT13_INT_CLR_V  0x1
#define SLC_FRHOST_BIT13_INT_CLR_S  5
/* SLC_FRHOST_BIT12_INT_CLR : WO ;bitpos:[4] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT12_INT_CLR  (BIT(4))
#define SLC_FRHOST_BIT12_INT_CLR_M  (BIT(4))
#define SLC_FRHOST_BIT12_INT_CLR_V  0x1
#define SLC_FRHOST_BIT12_INT_CLR_S  4
/* SLC_FRHOST_BIT11_INT_CLR : WO ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT11_INT_CLR  (BIT(3))
#define SLC_FRHOST_BIT11_INT_CLR_M  (BIT(3))
#define SLC_FRHOST_BIT11_INT_CLR_V  0x1
#define SLC_FRHOST_BIT11_INT_CLR_S  3
/* SLC_FRHOST_BIT10_INT_CLR : WO ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT10_INT_CLR  (BIT(2))
#define SLC_FRHOST_BIT10_INT_CLR_M  (BIT(2))
#define SLC_FRHOST_BIT10_INT_CLR_V  0x1
#define SLC_FRHOST_BIT10_INT_CLR_S  2
/* SLC_FRHOST_BIT9_INT_CLR : WO ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT9_INT_CLR  (BIT(1))
#define SLC_FRHOST_BIT9_INT_CLR_M  (BIT(1))
#define SLC_FRHOST_BIT9_INT_CLR_V  0x1
#define SLC_FRHOST_BIT9_INT_CLR_S  1
/* SLC_FRHOST_BIT8_INT_CLR : WO ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define SLC_FRHOST_BIT8_INT_CLR  (BIT(0))
#define SLC_FRHOST_BIT8_INT_CLR_M  (BIT(0))
#define SLC_FRHOST_BIT8_INT_CLR_V  0x1
#define SLC_FRHOST_BIT8_INT_CLR_S  0

#define SLC_RX_STATUS_REG          (DR_REG_SLC_BASE + 0x24)
/* SLC_SLC1_RX_EMPTY : RO ;bitpos:[17] ;default: 1'b1 ; */
/*description: */
#define SLC_SLC1_RX_EMPTY  (BIT(17))
#define SLC_SLC1_RX_EMPTY_M  (BIT(17))
#define SLC_SLC1_RX_EMPTY_V  0x1
#define SLC_SLC1_RX_EMPTY_S  17
/* SLC_SLC1_RX_FULL : RO ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_RX_FULL  (BIT(16))
#define SLC_SLC1_RX_FULL_M  (BIT(16))
#define SLC_SLC1_RX_FULL_V  0x1
#define SLC_SLC1_RX_FULL_S  16
/* SLC_SLC0_RX_EMPTY : RO ;bitpos:[1] ;default: 1'b1 ; */
/*description: */
#define SLC_SLC0_RX_EMPTY  (BIT(1))
#define SLC_SLC0_RX_EMPTY_M  (BIT(1))
#define SLC_SLC0_RX_EMPTY_V  0x1
#define SLC_SLC0_RX_EMPTY_S  1
/* SLC_SLC0_RX_FULL : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_RX_FULL  (BIT(0))
#define SLC_SLC0_RX_FULL_M  (BIT(0))
#define SLC_SLC0_RX_FULL_V  0x1
#define SLC_SLC0_RX_FULL_S  0

#define SLC_0RXFIFO_PUSH_REG          (DR_REG_SLC_BASE + 0x28)
/* SLC_SLC0_RXFIFO_PUSH : R/W ;bitpos:[16] ;default: 1'h0 ; */
/*description: */
#define SLC_SLC0_RXFIFO_PUSH  (BIT(16))
#define SLC_SLC0_RXFIFO_PUSH_M  (BIT(16))
#define SLC_SLC0_RXFIFO_PUSH_V  0x1
#define SLC_SLC0_RXFIFO_PUSH_S  16
/* SLC_SLC0_RXFIFO_WDATA : R/W ;bitpos:[8:0] ;default: 9'h0 ; */
/*description: */
#define SLC_SLC0_RXFIFO_WDATA  0x000001FF
#define SLC_SLC0_RXFIFO_WDATA_M  ((SLC_SLC0_RXFIFO_WDATA_V)<<(SLC_SLC0_RXFIFO_WDATA_S))
#define SLC_SLC0_RXFIFO_WDATA_V  0x1FF
#define SLC_SLC0_RXFIFO_WDATA_S  0

#define SLC_1RXFIFO_PUSH_REG          (DR_REG_SLC_BASE + 0x2C)
/* SLC_SLC1_RXFIFO_PUSH : R/W ;bitpos:[16] ;default: 1'h0 ; */
/*description: */
#define SLC_SLC1_RXFIFO_PUSH  (BIT(16))
#define SLC_SLC1_RXFIFO_PUSH_M  (BIT(16))
#define SLC_SLC1_RXFIFO_PUSH_V  0x1
#define SLC_SLC1_RXFIFO_PUSH_S  16
/* SLC_SLC1_RXFIFO_WDATA : R/W ;bitpos:[8:0] ;default: 9'h0 ; */
/*description: */
#define SLC_SLC1_RXFIFO_WDATA  0x000001FF
#define SLC_SLC1_RXFIFO_WDATA_M  ((SLC_SLC1_RXFIFO_WDATA_V)<<(SLC_SLC1_RXFIFO_WDATA_S))
#define SLC_SLC1_RXFIFO_WDATA_V  0x1FF
#define SLC_SLC1_RXFIFO_WDATA_S  0

#define SLC_TX_STATUS_REG          (DR_REG_SLC_BASE + 0x30)
/* SLC_SLC1_TX_EMPTY : RO ;bitpos:[17] ;default: 1'b1 ; */
/*description: */
#define SLC_SLC1_TX_EMPTY  (BIT(17))
#define SLC_SLC1_TX_EMPTY_M  (BIT(17))
#define SLC_SLC1_TX_EMPTY_V  0x1
#define SLC_SLC1_TX_EMPTY_S  17
/* SLC_SLC1_TX_FULL : RO ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TX_FULL  (BIT(16))
#define SLC_SLC1_TX_FULL_M  (BIT(16))
#define SLC_SLC1_TX_FULL_V  0x1
#define SLC_SLC1_TX_FULL_S  16
/* SLC_SLC0_TX_EMPTY : RO ;bitpos:[1] ;default: 1'b1 ; */
/*description: */
#define SLC_SLC0_TX_EMPTY  (BIT(1))
#define SLC_SLC0_TX_EMPTY_M  (BIT(1))
#define SLC_SLC0_TX_EMPTY_V  0x1
#define SLC_SLC0_TX_EMPTY_S  1
/* SLC_SLC0_TX_FULL : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TX_FULL  (BIT(0))
#define SLC_SLC0_TX_FULL_M  (BIT(0))
#define SLC_SLC0_TX_FULL_V  0x1
#define SLC_SLC0_TX_FULL_S  0

#define SLC_0TXFIFO_POP_REG          (DR_REG_SLC_BASE + 0x34)
/* SLC_SLC0_TXFIFO_POP : R/W ;bitpos:[16] ;default: 1'h0 ; */
/*description: */
#define SLC_SLC0_TXFIFO_POP  (BIT(16))
#define SLC_SLC0_TXFIFO_POP_M  (BIT(16))
#define SLC_SLC0_TXFIFO_POP_V  0x1
#define SLC_SLC0_TXFIFO_POP_S  16
/* SLC_SLC0_TXFIFO_RDATA : RO ;bitpos:[10:0] ;default: 11'h0 ; */
/*description: */
#define SLC_SLC0_TXFIFO_RDATA  0x000007FF
#define SLC_SLC0_TXFIFO_RDATA_M  ((SLC_SLC0_TXFIFO_RDATA_V)<<(SLC_SLC0_TXFIFO_RDATA_S))
#define SLC_SLC0_TXFIFO_RDATA_V  0x7FF
#define SLC_SLC0_TXFIFO_RDATA_S  0

#define SLC_1TXFIFO_POP_REG          (DR_REG_SLC_BASE + 0x38)
/* SLC_SLC1_TXFIFO_POP : R/W ;bitpos:[16] ;default: 1'h0 ; */
/*description: */
#define SLC_SLC1_TXFIFO_POP  (BIT(16))
#define SLC_SLC1_TXFIFO_POP_M  (BIT(16))
#define SLC_SLC1_TXFIFO_POP_V  0x1
#define SLC_SLC1_TXFIFO_POP_S  16
/* SLC_SLC1_TXFIFO_RDATA : RO ;bitpos:[10:0] ;default: 11'h0 ; */
/*description: */
#define SLC_SLC1_TXFIFO_RDATA  0x000007FF
#define SLC_SLC1_TXFIFO_RDATA_M  ((SLC_SLC1_TXFIFO_RDATA_V)<<(SLC_SLC1_TXFIFO_RDATA_S))
#define SLC_SLC1_TXFIFO_RDATA_V  0x7FF
#define SLC_SLC1_TXFIFO_RDATA_S  0

#define SLC_0RX_LINK_REG          (DR_REG_SLC_BASE + 0x3C)
/* SLC_SLC0_RXLINK_PARK : RO ;bitpos:[31] ;default: 1'h0 ; */
/*description: */
#define SLC_SLC0_RXLINK_PARK  (BIT(31))
#define SLC_SLC0_RXLINK_PARK_M  (BIT(31))
#define SLC_SLC0_RXLINK_PARK_V  0x1
#define SLC_SLC0_RXLINK_PARK_S  31
/* SLC_SLC0_RXLINK_RESTART : R/W ;bitpos:[30] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_RXLINK_RESTART  (BIT(30))
#define SLC_SLC0_RXLINK_RESTART_M  (BIT(30))
#define SLC_SLC0_RXLINK_RESTART_V  0x1
#define SLC_SLC0_RXLINK_RESTART_S  30
/* SLC_SLC0_RXLINK_START : R/W ;bitpos:[29] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_RXLINK_START  (BIT(29))
#define SLC_SLC0_RXLINK_START_M  (BIT(29))
#define SLC_SLC0_RXLINK_START_V  0x1
#define SLC_SLC0_RXLINK_START_S  29
/* SLC_SLC0_RXLINK_STOP : R/W ;bitpos:[28] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_RXLINK_STOP  (BIT(28))
#define SLC_SLC0_RXLINK_STOP_M  (BIT(28))
#define SLC_SLC0_RXLINK_STOP_V  0x1
#define SLC_SLC0_RXLINK_STOP_S  28
/* SLC_SLC0_RXLINK_ADDR : R/W ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: */
#define SLC_SLC0_RXLINK_ADDR  0x000FFFFF
#define SLC_SLC0_RXLINK_ADDR_M  ((SLC_SLC0_RXLINK_ADDR_V)<<(SLC_SLC0_RXLINK_ADDR_S))
#define SLC_SLC0_RXLINK_ADDR_V  0xFFFFF
#define SLC_SLC0_RXLINK_ADDR_S  0

#define SLC_0TX_LINK_REG          (DR_REG_SLC_BASE + 0x40)
/* SLC_SLC0_TXLINK_PARK : RO ;bitpos:[31] ;default: 1'h0 ; */
/*description: */
#define SLC_SLC0_TXLINK_PARK  (BIT(31))
#define SLC_SLC0_TXLINK_PARK_M  (BIT(31))
#define SLC_SLC0_TXLINK_PARK_V  0x1
#define SLC_SLC0_TXLINK_PARK_S  31
/* SLC_SLC0_TXLINK_RESTART : R/W ;bitpos:[30] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TXLINK_RESTART  (BIT(30))
#define SLC_SLC0_TXLINK_RESTART_M  (BIT(30))
#define SLC_SLC0_TXLINK_RESTART_V  0x1
#define SLC_SLC0_TXLINK_RESTART_S  30
/* SLC_SLC0_TXLINK_START : R/W ;bitpos:[29] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TXLINK_START  (BIT(29))
#define SLC_SLC0_TXLINK_START_M  (BIT(29))
#define SLC_SLC0_TXLINK_START_V  0x1
#define SLC_SLC0_TXLINK_START_S  29
/* SLC_SLC0_TXLINK_STOP : R/W ;bitpos:[28] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TXLINK_STOP  (BIT(28))
#define SLC_SLC0_TXLINK_STOP_M  (BIT(28))
#define SLC_SLC0_TXLINK_STOP_V  0x1
#define SLC_SLC0_TXLINK_STOP_S  28
/* SLC_SLC0_TXLINK_ADDR : R/W ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: */
#define SLC_SLC0_TXLINK_ADDR  0x000FFFFF
#define SLC_SLC0_TXLINK_ADDR_M  ((SLC_SLC0_TXLINK_ADDR_V)<<(SLC_SLC0_TXLINK_ADDR_S))
#define SLC_SLC0_TXLINK_ADDR_V  0xFFFFF
#define SLC_SLC0_TXLINK_ADDR_S  0

#define SLC_1RX_LINK_REG          (DR_REG_SLC_BASE + 0x44)
/* SLC_SLC1_RXLINK_PARK : RO ;bitpos:[31] ;default: 1'h0 ; */
/*description: */
#define SLC_SLC1_RXLINK_PARK  (BIT(31))
#define SLC_SLC1_RXLINK_PARK_M  (BIT(31))
#define SLC_SLC1_RXLINK_PARK_V  0x1
#define SLC_SLC1_RXLINK_PARK_S  31
/* SLC_SLC1_RXLINK_RESTART : R/W ;bitpos:[30] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_RXLINK_RESTART  (BIT(30))
#define SLC_SLC1_RXLINK_RESTART_M  (BIT(30))
#define SLC_SLC1_RXLINK_RESTART_V  0x1
#define SLC_SLC1_RXLINK_RESTART_S  30
/* SLC_SLC1_RXLINK_START : R/W ;bitpos:[29] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_RXLINK_START  (BIT(29))
#define SLC_SLC1_RXLINK_START_M  (BIT(29))
#define SLC_SLC1_RXLINK_START_V  0x1
#define SLC_SLC1_RXLINK_START_S  29
/* SLC_SLC1_RXLINK_STOP : R/W ;bitpos:[28] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_RXLINK_STOP  (BIT(28))
#define SLC_SLC1_RXLINK_STOP_M  (BIT(28))
#define SLC_SLC1_RXLINK_STOP_V  0x1
#define SLC_SLC1_RXLINK_STOP_S  28
/* SLC_SLC1_BT_PACKET : R/W ;bitpos:[20] ;default: 1'b1 ; */
/*description: */
#define SLC_SLC1_BT_PACKET  (BIT(20))
#define SLC_SLC1_BT_PACKET_M  (BIT(20))
#define SLC_SLC1_BT_PACKET_V  0x1
#define SLC_SLC1_BT_PACKET_S  20
/* SLC_SLC1_RXLINK_ADDR : R/W ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: */
#define SLC_SLC1_RXLINK_ADDR  0x000FFFFF
#define SLC_SLC1_RXLINK_ADDR_M  ((SLC_SLC1_RXLINK_ADDR_V)<<(SLC_SLC1_RXLINK_ADDR_S))
#define SLC_SLC1_RXLINK_ADDR_V  0xFFFFF
#define SLC_SLC1_RXLINK_ADDR_S  0

