espressif/esp-idf/components/soc/esp32/register/soc/sdio_slc_reg.h
#define SLC_1TX_LINK_REG          (DR_REG_SLC_BASE + 0x48)
/* SLC_SLC1_TXLINK_PARK : RO ;bitpos:[31] ;default: 1'h0 ; */
/*description: */
#define SLC_SLC1_TXLINK_PARK  (BIT(31))
#define SLC_SLC1_TXLINK_PARK_M  (BIT(31))
#define SLC_SLC1_TXLINK_PARK_V  0x1
#define SLC_SLC1_TXLINK_PARK_S  31
/* SLC_SLC1_TXLINK_RESTART : R/W ;bitpos:[30] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TXLINK_RESTART  (BIT(30))
#define SLC_SLC1_TXLINK_RESTART_M  (BIT(30))
#define SLC_SLC1_TXLINK_RESTART_V  0x1
#define SLC_SLC1_TXLINK_RESTART_S  30
/* SLC_SLC1_TXLINK_START : R/W ;bitpos:[29] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TXLINK_START  (BIT(29))
#define SLC_SLC1_TXLINK_START_M  (BIT(29))
#define SLC_SLC1_TXLINK_START_V  0x1
#define SLC_SLC1_TXLINK_START_S  29
/* SLC_SLC1_TXLINK_STOP : R/W ;bitpos:[28] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TXLINK_STOP  (BIT(28))
#define SLC_SLC1_TXLINK_STOP_M  (BIT(28))
#define SLC_SLC1_TXLINK_STOP_V  0x1
#define SLC_SLC1_TXLINK_STOP_S  28
/* SLC_SLC1_TXLINK_ADDR : R/W ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: */
#define SLC_SLC1_TXLINK_ADDR  0x000FFFFF
#define SLC_SLC1_TXLINK_ADDR_M  ((SLC_SLC1_TXLINK_ADDR_V)<<(SLC_SLC1_TXLINK_ADDR_S))
#define SLC_SLC1_TXLINK_ADDR_V  0xFFFFF
#define SLC_SLC1_TXLINK_ADDR_S  0

#define SLC_INTVEC_TOHOST_REG          (DR_REG_SLC_BASE + 0x4C)
/* SLC_SLC1_TOHOST_INTVEC : WO ;bitpos:[23:16] ;default: 8'h0 ; */
/*description: */
#define SLC_SLC1_TOHOST_INTVEC  0x000000FF
#define SLC_SLC1_TOHOST_INTVEC_M  ((SLC_SLC1_TOHOST_INTVEC_V)<<(SLC_SLC1_TOHOST_INTVEC_S))
#define SLC_SLC1_TOHOST_INTVEC_V  0xFF
#define SLC_SLC1_TOHOST_INTVEC_S  16
/* SLC_SLC0_TOHOST_INTVEC : WO ;bitpos:[7:0] ;default: 8'h0 ; */
/*description: */
#define SLC_SLC0_TOHOST_INTVEC  0x000000FF
#define SLC_SLC0_TOHOST_INTVEC_M  ((SLC_SLC0_TOHOST_INTVEC_V)<<(SLC_SLC0_TOHOST_INTVEC_S))
#define SLC_SLC0_TOHOST_INTVEC_V  0xFF
#define SLC_SLC0_TOHOST_INTVEC_S  0

#define SLC_0TOKEN0_REG          (DR_REG_SLC_BASE + 0x50)
/* SLC_SLC0_TOKEN0 : RO ;bitpos:[27:16] ;default: 12'h0 ; */
/*description: */
#define SLC_SLC0_TOKEN0  0x00000FFF
#define SLC_SLC0_TOKEN0_M  ((SLC_SLC0_TOKEN0_V)<<(SLC_SLC0_TOKEN0_S))
#define SLC_SLC0_TOKEN0_V  0xFFF
#define SLC_SLC0_TOKEN0_S  16
/* SLC_SLC0_TOKEN0_INC_MORE : WO ;bitpos:[14] ;default: 1'h0 ; */
/*description: */
#define SLC_SLC0_TOKEN0_INC_MORE  (BIT(14))
#define SLC_SLC0_TOKEN0_INC_MORE_M  (BIT(14))
#define SLC_SLC0_TOKEN0_INC_MORE_V  0x1
#define SLC_SLC0_TOKEN0_INC_MORE_S  14
/* SLC_SLC0_TOKEN0_INC : WO ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TOKEN0_INC  (BIT(13))
#define SLC_SLC0_TOKEN0_INC_M  (BIT(13))
#define SLC_SLC0_TOKEN0_INC_V  0x1
#define SLC_SLC0_TOKEN0_INC_S  13
/* SLC_SLC0_TOKEN0_WR : WO ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TOKEN0_WR  (BIT(12))
#define SLC_SLC0_TOKEN0_WR_M  (BIT(12))
#define SLC_SLC0_TOKEN0_WR_V  0x1
#define SLC_SLC0_TOKEN0_WR_S  12
/* SLC_SLC0_TOKEN0_WDATA : WO ;bitpos:[11:0] ;default: 12'h0 ; */
/*description: */
#define SLC_SLC0_TOKEN0_WDATA  0x00000FFF
#define SLC_SLC0_TOKEN0_WDATA_M  ((SLC_SLC0_TOKEN0_WDATA_V)<<(SLC_SLC0_TOKEN0_WDATA_S))
#define SLC_SLC0_TOKEN0_WDATA_V  0xFFF
#define SLC_SLC0_TOKEN0_WDATA_S  0

#define SLC_0TOKEN1_REG          (DR_REG_SLC_BASE + 0x54)
/* SLC_SLC0_TOKEN1 : RO ;bitpos:[27:16] ;default: 12'h0 ; */
/*description: */
#define SLC_SLC0_TOKEN1  0x00000FFF
#define SLC_SLC0_TOKEN1_M  ((SLC_SLC0_TOKEN1_V)<<(SLC_SLC0_TOKEN1_S))
#define SLC_SLC0_TOKEN1_V  0xFFF
#define SLC_SLC0_TOKEN1_S  16
/* SLC_SLC0_TOKEN1_INC_MORE : WO ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TOKEN1_INC_MORE  (BIT(14))
#define SLC_SLC0_TOKEN1_INC_MORE_M  (BIT(14))
#define SLC_SLC0_TOKEN1_INC_MORE_V  0x1
#define SLC_SLC0_TOKEN1_INC_MORE_S  14
/* SLC_SLC0_TOKEN1_INC : WO ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TOKEN1_INC  (BIT(13))
#define SLC_SLC0_TOKEN1_INC_M  (BIT(13))
#define SLC_SLC0_TOKEN1_INC_V  0x1
#define SLC_SLC0_TOKEN1_INC_S  13
/* SLC_SLC0_TOKEN1_WR : WO ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TOKEN1_WR  (BIT(12))
#define SLC_SLC0_TOKEN1_WR_M  (BIT(12))
#define SLC_SLC0_TOKEN1_WR_V  0x1
#define SLC_SLC0_TOKEN1_WR_S  12
/* SLC_SLC0_TOKEN1_WDATA : WO ;bitpos:[11:0] ;default: 12'h0 ; */
/*description: */
#define SLC_SLC0_TOKEN1_WDATA  0x00000FFF
#define SLC_SLC0_TOKEN1_WDATA_M  ((SLC_SLC0_TOKEN1_WDATA_V)<<(SLC_SLC0_TOKEN1_WDATA_S))
#define SLC_SLC0_TOKEN1_WDATA_V  0xFFF
#define SLC_SLC0_TOKEN1_WDATA_S  0

#define SLC_1TOKEN0_REG          (DR_REG_SLC_BASE + 0x58)
/* SLC_SLC1_TOKEN0 : RO ;bitpos:[27:16] ;default: 12'h0 ; */
/*description: */
#define SLC_SLC1_TOKEN0  0x00000FFF
#define SLC_SLC1_TOKEN0_M  ((SLC_SLC1_TOKEN0_V)<<(SLC_SLC1_TOKEN0_S))
#define SLC_SLC1_TOKEN0_V  0xFFF
#define SLC_SLC1_TOKEN0_S  16
/* SLC_SLC1_TOKEN0_INC_MORE : WO ;bitpos:[14] ;default: 1'h0 ; */
/*description: */
#define SLC_SLC1_TOKEN0_INC_MORE  (BIT(14))
#define SLC_SLC1_TOKEN0_INC_MORE_M  (BIT(14))
#define SLC_SLC1_TOKEN0_INC_MORE_V  0x1
#define SLC_SLC1_TOKEN0_INC_MORE_S  14
/* SLC_SLC1_TOKEN0_INC : WO ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TOKEN0_INC  (BIT(13))
#define SLC_SLC1_TOKEN0_INC_M  (BIT(13))
#define SLC_SLC1_TOKEN0_INC_V  0x1
#define SLC_SLC1_TOKEN0_INC_S  13
/* SLC_SLC1_TOKEN0_WR : WO ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TOKEN0_WR  (BIT(12))
#define SLC_SLC1_TOKEN0_WR_M  (BIT(12))
#define SLC_SLC1_TOKEN0_WR_V  0x1
#define SLC_SLC1_TOKEN0_WR_S  12
/* SLC_SLC1_TOKEN0_WDATA : WO ;bitpos:[11:0] ;default: 12'h0 ; */
/*description: */
#define SLC_SLC1_TOKEN0_WDATA  0x00000FFF
#define SLC_SLC1_TOKEN0_WDATA_M  ((SLC_SLC1_TOKEN0_WDATA_V)<<(SLC_SLC1_TOKEN0_WDATA_S))
#define SLC_SLC1_TOKEN0_WDATA_V  0xFFF
#define SLC_SLC1_TOKEN0_WDATA_S  0

#define SLC_1TOKEN1_REG          (DR_REG_SLC_BASE + 0x5C)
/* SLC_SLC1_TOKEN1 : RO ;bitpos:[27:16] ;default: 12'h0 ; */
/*description: */
#define SLC_SLC1_TOKEN1  0x00000FFF
#define SLC_SLC1_TOKEN1_M  ((SLC_SLC1_TOKEN1_V)<<(SLC_SLC1_TOKEN1_S))
#define SLC_SLC1_TOKEN1_V  0xFFF
#define SLC_SLC1_TOKEN1_S  16
/* SLC_SLC1_TOKEN1_INC_MORE : WO ;bitpos:[14] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TOKEN1_INC_MORE  (BIT(14))
#define SLC_SLC1_TOKEN1_INC_MORE_M  (BIT(14))
#define SLC_SLC1_TOKEN1_INC_MORE_V  0x1
#define SLC_SLC1_TOKEN1_INC_MORE_S  14
/* SLC_SLC1_TOKEN1_INC : WO ;bitpos:[13] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TOKEN1_INC  (BIT(13))
#define SLC_SLC1_TOKEN1_INC_M  (BIT(13))
#define SLC_SLC1_TOKEN1_INC_V  0x1
#define SLC_SLC1_TOKEN1_INC_S  13
/* SLC_SLC1_TOKEN1_WR : WO ;bitpos:[12] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TOKEN1_WR  (BIT(12))
#define SLC_SLC1_TOKEN1_WR_M  (BIT(12))
#define SLC_SLC1_TOKEN1_WR_V  0x1
#define SLC_SLC1_TOKEN1_WR_S  12
/* SLC_SLC1_TOKEN1_WDATA : WO ;bitpos:[11:0] ;default: 12'h0 ; */
/*description: */
#define SLC_SLC1_TOKEN1_WDATA  0x00000FFF
#define SLC_SLC1_TOKEN1_WDATA_M  ((SLC_SLC1_TOKEN1_WDATA_V)<<(SLC_SLC1_TOKEN1_WDATA_S))
#define SLC_SLC1_TOKEN1_WDATA_V  0xFFF
#define SLC_SLC1_TOKEN1_WDATA_S  0

#define SLC_CONF1_REG          (DR_REG_SLC_BASE + 0x60)
/* SLC_CLK_EN : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: */
#define SLC_CLK_EN  (BIT(22))
#define SLC_CLK_EN_M  (BIT(22))
#define SLC_CLK_EN_V  0x1
#define SLC_CLK_EN_S  22
/* SLC_SLC1_RX_STITCH_EN : R/W ;bitpos:[21] ;default: 1'b1 ; */
/*description: */
#define SLC_SLC1_RX_STITCH_EN  (BIT(21))
#define SLC_SLC1_RX_STITCH_EN_M  (BIT(21))
#define SLC_SLC1_RX_STITCH_EN_V  0x1
#define SLC_SLC1_RX_STITCH_EN_S  21
/* SLC_SLC1_TX_STITCH_EN : R/W ;bitpos:[20] ;default: 1'b1 ; */
/*description: */
#define SLC_SLC1_TX_STITCH_EN  (BIT(20))
#define SLC_SLC1_TX_STITCH_EN_M  (BIT(20))
#define SLC_SLC1_TX_STITCH_EN_V  0x1
#define SLC_SLC1_TX_STITCH_EN_S  20
/* SLC_HOST_INT_LEVEL_SEL : R/W ;bitpos:[19] ;default: 1'b0 ; */
/*description: */
#define SLC_HOST_INT_LEVEL_SEL  (BIT(19))
#define SLC_HOST_INT_LEVEL_SEL_M  (BIT(19))
#define SLC_HOST_INT_LEVEL_SEL_V  0x1
#define SLC_HOST_INT_LEVEL_SEL_S  19
/* SLC_SLC1_RX_CHECK_SUM_EN : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_RX_CHECK_SUM_EN  (BIT(18))
#define SLC_SLC1_RX_CHECK_SUM_EN_M  (BIT(18))
#define SLC_SLC1_RX_CHECK_SUM_EN_V  0x1
#define SLC_SLC1_RX_CHECK_SUM_EN_S  18
/* SLC_SLC1_TX_CHECK_SUM_EN : R/W ;bitpos:[17] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_TX_CHECK_SUM_EN  (BIT(17))
#define SLC_SLC1_TX_CHECK_SUM_EN_M  (BIT(17))
#define SLC_SLC1_TX_CHECK_SUM_EN_V  0x1
#define SLC_SLC1_TX_CHECK_SUM_EN_S  17
/* SLC_SLC1_CHECK_OWNER : R/W ;bitpos:[16] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_CHECK_OWNER  (BIT(16))
#define SLC_SLC1_CHECK_OWNER_M  (BIT(16))
#define SLC_SLC1_CHECK_OWNER_V  0x1
#define SLC_SLC1_CHECK_OWNER_S  16
/* SLC_SLC0_RX_STITCH_EN : R/W ;bitpos:[6] ;default: 1'b1 ; */
/*description: */
#define SLC_SLC0_RX_STITCH_EN  (BIT(6))
#define SLC_SLC0_RX_STITCH_EN_M  (BIT(6))
#define SLC_SLC0_RX_STITCH_EN_V  0x1
#define SLC_SLC0_RX_STITCH_EN_S  6
/* SLC_SLC0_TX_STITCH_EN : R/W ;bitpos:[5] ;default: 1'b1 ; */
/*description: */
#define SLC_SLC0_TX_STITCH_EN  (BIT(5))
#define SLC_SLC0_TX_STITCH_EN_M  (BIT(5))
#define SLC_SLC0_TX_STITCH_EN_V  0x1
#define SLC_SLC0_TX_STITCH_EN_S  5
/* SLC_SLC0_LEN_AUTO_CLR : R/W ;bitpos:[4] ;default: 1'b1 ; */
/*description: */
#define SLC_SLC0_LEN_AUTO_CLR  (BIT(4))
#define SLC_SLC0_LEN_AUTO_CLR_M  (BIT(4))
#define SLC_SLC0_LEN_AUTO_CLR_V  0x1
#define SLC_SLC0_LEN_AUTO_CLR_S  4
/* SLC_CMD_HOLD_EN : R/W ;bitpos:[3] ;default: 1'b1 ; */
/*description: */
#define SLC_CMD_HOLD_EN  (BIT(3))
#define SLC_CMD_HOLD_EN_M  (BIT(3))
#define SLC_CMD_HOLD_EN_V  0x1
#define SLC_CMD_HOLD_EN_S  3
/* SLC_SLC0_RX_CHECK_SUM_EN : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_RX_CHECK_SUM_EN  (BIT(2))
#define SLC_SLC0_RX_CHECK_SUM_EN_M  (BIT(2))
#define SLC_SLC0_RX_CHECK_SUM_EN_V  0x1
#define SLC_SLC0_RX_CHECK_SUM_EN_S  2
/* SLC_SLC0_TX_CHECK_SUM_EN : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TX_CHECK_SUM_EN  (BIT(1))
#define SLC_SLC0_TX_CHECK_SUM_EN_M  (BIT(1))
#define SLC_SLC0_TX_CHECK_SUM_EN_V  0x1
#define SLC_SLC0_TX_CHECK_SUM_EN_S  1
/* SLC_SLC0_CHECK_OWNER : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_CHECK_OWNER  (BIT(0))
#define SLC_SLC0_CHECK_OWNER_M  (BIT(0))
#define SLC_SLC0_CHECK_OWNER_V  0x1
#define SLC_SLC0_CHECK_OWNER_S  0

#define SLC_0_STATE0_REG          (DR_REG_SLC_BASE + 0x64)
/* SLC_SLC0_STATE0 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define SLC_SLC0_STATE0  0xFFFFFFFF
#define SLC_SLC0_STATE0_M  ((SLC_SLC0_STATE0_V)<<(SLC_SLC0_STATE0_S))
#define SLC_SLC0_STATE0_V  0xFFFFFFFF
#define SLC_SLC0_STATE0_S  0

#define SLC_0_STATE1_REG          (DR_REG_SLC_BASE + 0x68)
/* SLC_SLC0_STATE1 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define SLC_SLC0_STATE1  0xFFFFFFFF
#define SLC_SLC0_STATE1_M  ((SLC_SLC0_STATE1_V)<<(SLC_SLC0_STATE1_S))
#define SLC_SLC0_STATE1_V  0xFFFFFFFF
#define SLC_SLC0_STATE1_S  0

