espressif/esp-idf/components/soc/esp32/register/soc/sdio_slc_reg.h
#define SLC_1_STATE0_REG          (DR_REG_SLC_BASE + 0x6C)
/* SLC_SLC1_STATE0 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define SLC_SLC1_STATE0  0xFFFFFFFF
#define SLC_SLC1_STATE0_M  ((SLC_SLC1_STATE0_V)<<(SLC_SLC1_STATE0_S))
#define SLC_SLC1_STATE0_V  0xFFFFFFFF
#define SLC_SLC1_STATE0_S  0

#define SLC_1_STATE1_REG          (DR_REG_SLC_BASE + 0x70)
/* SLC_SLC1_STATE1 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define SLC_SLC1_STATE1  0xFFFFFFFF
#define SLC_SLC1_STATE1_M  ((SLC_SLC1_STATE1_V)<<(SLC_SLC1_STATE1_S))
#define SLC_SLC1_STATE1_V  0xFFFFFFFF
#define SLC_SLC1_STATE1_S  0

#define SLC_BRIDGE_CONF_REG          (DR_REG_SLC_BASE + 0x74)
/* SLC_TX_PUSH_IDLE_NUM : R/W ;bitpos:[31:16] ;default: 16'ha ; */
/*description: */
#define SLC_TX_PUSH_IDLE_NUM  0x0000FFFF
#define SLC_TX_PUSH_IDLE_NUM_M  ((SLC_TX_PUSH_IDLE_NUM_V)<<(SLC_TX_PUSH_IDLE_NUM_S))
#define SLC_TX_PUSH_IDLE_NUM_V  0xFFFF
#define SLC_TX_PUSH_IDLE_NUM_S  16
/* SLC_SLC1_TX_DUMMY_MODE : R/W ;bitpos:[14] ;default: 1'h1 ; */
/*description: */
#define SLC_SLC1_TX_DUMMY_MODE  (BIT(14))
#define SLC_SLC1_TX_DUMMY_MODE_M  (BIT(14))
#define SLC_SLC1_TX_DUMMY_MODE_V  0x1
#define SLC_SLC1_TX_DUMMY_MODE_S  14
/* SLC_HDA_MAP_128K : R/W ;bitpos:[13] ;default: 1'h1 ; */
/*description: */
#define SLC_HDA_MAP_128K  (BIT(13))
#define SLC_HDA_MAP_128K_M  (BIT(13))
#define SLC_HDA_MAP_128K_V  0x1
#define SLC_HDA_MAP_128K_S  13
/* SLC_SLC0_TX_DUMMY_MODE : R/W ;bitpos:[12] ;default: 1'h1 ; */
/*description: */
#define SLC_SLC0_TX_DUMMY_MODE  (BIT(12))
#define SLC_SLC0_TX_DUMMY_MODE_M  (BIT(12))
#define SLC_SLC0_TX_DUMMY_MODE_V  0x1
#define SLC_SLC0_TX_DUMMY_MODE_S  12
/* SLC_FIFO_MAP_ENA : R/W ;bitpos:[11:8] ;default: 4'h7 ; */
/*description: */
#define SLC_FIFO_MAP_ENA  0x0000000F
#define SLC_FIFO_MAP_ENA_M  ((SLC_FIFO_MAP_ENA_V)<<(SLC_FIFO_MAP_ENA_S))
#define SLC_FIFO_MAP_ENA_V  0xF
#define SLC_FIFO_MAP_ENA_S  8
/* SLC_TXEOF_ENA : R/W ;bitpos:[5:0] ;default: 6'h20 ; */
/*description: */
#define SLC_TXEOF_ENA  0x0000003F
#define SLC_TXEOF_ENA_M  ((SLC_TXEOF_ENA_V)<<(SLC_TXEOF_ENA_S))
#define SLC_TXEOF_ENA_V  0x3F
#define SLC_TXEOF_ENA_S  0

#define SLC_0_TO_EOF_DES_ADDR_REG          (DR_REG_SLC_BASE + 0x78)
/* SLC_SLC0_TO_EOF_DES_ADDR : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define SLC_SLC0_TO_EOF_DES_ADDR  0xFFFFFFFF
#define SLC_SLC0_TO_EOF_DES_ADDR_M  ((SLC_SLC0_TO_EOF_DES_ADDR_V)<<(SLC_SLC0_TO_EOF_DES_ADDR_S))
#define SLC_SLC0_TO_EOF_DES_ADDR_V  0xFFFFFFFF
#define SLC_SLC0_TO_EOF_DES_ADDR_S  0

#define SLC_0_TX_EOF_DES_ADDR_REG          (DR_REG_SLC_BASE + 0x7C)
/* SLC_SLC0_TX_SUC_EOF_DES_ADDR : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define SLC_SLC0_TX_SUC_EOF_DES_ADDR  0xFFFFFFFF
#define SLC_SLC0_TX_SUC_EOF_DES_ADDR_M  ((SLC_SLC0_TX_SUC_EOF_DES_ADDR_V)<<(SLC_SLC0_TX_SUC_EOF_DES_ADDR_S))
#define SLC_SLC0_TX_SUC_EOF_DES_ADDR_V  0xFFFFFFFF
#define SLC_SLC0_TX_SUC_EOF_DES_ADDR_S  0

#define SLC_0_TO_EOF_BFR_DES_ADDR_REG          (DR_REG_SLC_BASE + 0x80)
/* SLC_SLC0_TO_EOF_BFR_DES_ADDR : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define SLC_SLC0_TO_EOF_BFR_DES_ADDR  0xFFFFFFFF
#define SLC_SLC0_TO_EOF_BFR_DES_ADDR_M  ((SLC_SLC0_TO_EOF_BFR_DES_ADDR_V)<<(SLC_SLC0_TO_EOF_BFR_DES_ADDR_S))
#define SLC_SLC0_TO_EOF_BFR_DES_ADDR_V  0xFFFFFFFF
#define SLC_SLC0_TO_EOF_BFR_DES_ADDR_S  0

#define SLC_1_TO_EOF_DES_ADDR_REG          (DR_REG_SLC_BASE + 0x84)
/* SLC_SLC1_TO_EOF_DES_ADDR : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define SLC_SLC1_TO_EOF_DES_ADDR  0xFFFFFFFF
#define SLC_SLC1_TO_EOF_DES_ADDR_M  ((SLC_SLC1_TO_EOF_DES_ADDR_V)<<(SLC_SLC1_TO_EOF_DES_ADDR_S))
#define SLC_SLC1_TO_EOF_DES_ADDR_V  0xFFFFFFFF
#define SLC_SLC1_TO_EOF_DES_ADDR_S  0

#define SLC_1_TX_EOF_DES_ADDR_REG          (DR_REG_SLC_BASE + 0x88)
/* SLC_SLC1_TX_SUC_EOF_DES_ADDR : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define SLC_SLC1_TX_SUC_EOF_DES_ADDR  0xFFFFFFFF
#define SLC_SLC1_TX_SUC_EOF_DES_ADDR_M  ((SLC_SLC1_TX_SUC_EOF_DES_ADDR_V)<<(SLC_SLC1_TX_SUC_EOF_DES_ADDR_S))
#define SLC_SLC1_TX_SUC_EOF_DES_ADDR_V  0xFFFFFFFF
#define SLC_SLC1_TX_SUC_EOF_DES_ADDR_S  0

#define SLC_1_TO_EOF_BFR_DES_ADDR_REG          (DR_REG_SLC_BASE + 0x8C)
/* SLC_SLC1_TO_EOF_BFR_DES_ADDR : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define SLC_SLC1_TO_EOF_BFR_DES_ADDR  0xFFFFFFFF
#define SLC_SLC1_TO_EOF_BFR_DES_ADDR_M  ((SLC_SLC1_TO_EOF_BFR_DES_ADDR_V)<<(SLC_SLC1_TO_EOF_BFR_DES_ADDR_S))
#define SLC_SLC1_TO_EOF_BFR_DES_ADDR_V  0xFFFFFFFF
#define SLC_SLC1_TO_EOF_BFR_DES_ADDR_S  0

#define SLC_AHB_TEST_REG          (DR_REG_SLC_BASE + 0x90)
/* SLC_AHB_TESTADDR : R/W ;bitpos:[5:4] ;default: 2'b0 ; */
/*description: */
#define SLC_AHB_TESTADDR  0x00000003
#define SLC_AHB_TESTADDR_M  ((SLC_AHB_TESTADDR_V)<<(SLC_AHB_TESTADDR_S))
#define SLC_AHB_TESTADDR_V  0x3
#define SLC_AHB_TESTADDR_S  4
/* SLC_AHB_TESTMODE : R/W ;bitpos:[2:0] ;default: 3'b0 ; */
/*description: */
#define SLC_AHB_TESTMODE  0x00000007
#define SLC_AHB_TESTMODE_M  ((SLC_AHB_TESTMODE_V)<<(SLC_AHB_TESTMODE_S))
#define SLC_AHB_TESTMODE_V  0x7
#define SLC_AHB_TESTMODE_S  0

#define SLC_SDIO_ST_REG          (DR_REG_SLC_BASE + 0x94)
/* SLC_FUNC2_ACC_STATE : RO ;bitpos:[28:24] ;default: 5'b0 ; */
/*description: */
#define SLC_FUNC2_ACC_STATE  0x0000001F
#define SLC_FUNC2_ACC_STATE_M  ((SLC_FUNC2_ACC_STATE_V)<<(SLC_FUNC2_ACC_STATE_S))
#define SLC_FUNC2_ACC_STATE_V  0x1F
#define SLC_FUNC2_ACC_STATE_S  24
/* SLC_FUNC1_ACC_STATE : RO ;bitpos:[20:16] ;default: 5'b0 ; */
/*description: */
#define SLC_FUNC1_ACC_STATE  0x0000001F
#define SLC_FUNC1_ACC_STATE_M  ((SLC_FUNC1_ACC_STATE_V)<<(SLC_FUNC1_ACC_STATE_S))
#define SLC_FUNC1_ACC_STATE_V  0x1F
#define SLC_FUNC1_ACC_STATE_S  16
/* SLC_BUS_ST : RO ;bitpos:[14:12] ;default: 3'b0 ; */
/*description: */
#define SLC_BUS_ST  0x00000007
#define SLC_BUS_ST_M  ((SLC_BUS_ST_V)<<(SLC_BUS_ST_S))
#define SLC_BUS_ST_V  0x7
#define SLC_BUS_ST_S  12
/* SLC_SDIO_WAKEUP : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: */
#define SLC_SDIO_WAKEUP  (BIT(8))
#define SLC_SDIO_WAKEUP_M  (BIT(8))
#define SLC_SDIO_WAKEUP_V  0x1
#define SLC_SDIO_WAKEUP_S  8
/* SLC_FUNC_ST : RO ;bitpos:[7:4] ;default: 4'b0 ; */
/*description: */
#define SLC_FUNC_ST  0x0000000F
#define SLC_FUNC_ST_M  ((SLC_FUNC_ST_V)<<(SLC_FUNC_ST_S))
#define SLC_FUNC_ST_V  0xF
#define SLC_FUNC_ST_S  4
/* SLC_CMD_ST : RO ;bitpos:[2:0] ;default: 3'b0 ; */
/*description: */
#define SLC_CMD_ST  0x00000007
#define SLC_CMD_ST_M  ((SLC_CMD_ST_V)<<(SLC_CMD_ST_S))
#define SLC_CMD_ST_V  0x7
#define SLC_CMD_ST_S  0

