espressif/esp-idf/components/soc/esp32/register/soc/sdio_slc_reg.h
#define SLC_RX_DSCR_CONF_REG          (DR_REG_SLC_BASE + 0x98)
/* SLC_SLC1_RD_RETRY_THRESHOLD : R/W ;bitpos:[31:21] ;default: 11'h80 ; */
/*description: */
#define SLC_SLC1_RD_RETRY_THRESHOLD  0x000007FF
#define SLC_SLC1_RD_RETRY_THRESHOLD_M  ((SLC_SLC1_RD_RETRY_THRESHOLD_V)<<(SLC_SLC1_RD_RETRY_THRESHOLD_S))
#define SLC_SLC1_RD_RETRY_THRESHOLD_V  0x7FF
#define SLC_SLC1_RD_RETRY_THRESHOLD_S  21
/* SLC_SLC1_RX_FILL_EN : R/W ;bitpos:[20] ;default: 1'b1 ; */
/*description: */
#define SLC_SLC1_RX_FILL_EN  (BIT(20))
#define SLC_SLC1_RX_FILL_EN_M  (BIT(20))
#define SLC_SLC1_RX_FILL_EN_V  0x1
#define SLC_SLC1_RX_FILL_EN_S  20
/* SLC_SLC1_RX_EOF_MODE : R/W ;bitpos:[19] ;default: 1'b1 ; */
/*description: */
#define SLC_SLC1_RX_EOF_MODE  (BIT(19))
#define SLC_SLC1_RX_EOF_MODE_M  (BIT(19))
#define SLC_SLC1_RX_EOF_MODE_V  0x1
#define SLC_SLC1_RX_EOF_MODE_S  19
/* SLC_SLC1_RX_FILL_MODE : R/W ;bitpos:[18] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC1_RX_FILL_MODE  (BIT(18))
#define SLC_SLC1_RX_FILL_MODE_M  (BIT(18))
#define SLC_SLC1_RX_FILL_MODE_V  0x1
#define SLC_SLC1_RX_FILL_MODE_S  18
/* SLC_SLC1_INFOR_NO_REPLACE : R/W ;bitpos:[17] ;default: 1'b1 ; */
/*description: */
#define SLC_SLC1_INFOR_NO_REPLACE  (BIT(17))
#define SLC_SLC1_INFOR_NO_REPLACE_M  (BIT(17))
#define SLC_SLC1_INFOR_NO_REPLACE_V  0x1
#define SLC_SLC1_INFOR_NO_REPLACE_S  17
/* SLC_SLC1_TOKEN_NO_REPLACE : R/W ;bitpos:[16] ;default: 1'b1 ; */
/*description: */
#define SLC_SLC1_TOKEN_NO_REPLACE  (BIT(16))
#define SLC_SLC1_TOKEN_NO_REPLACE_M  (BIT(16))
#define SLC_SLC1_TOKEN_NO_REPLACE_V  0x1
#define SLC_SLC1_TOKEN_NO_REPLACE_S  16
/* SLC_SLC0_RD_RETRY_THRESHOLD : R/W ;bitpos:[15:5] ;default: 11'h80 ; */
/*description: */
#define SLC_SLC0_RD_RETRY_THRESHOLD  0x000007FF
#define SLC_SLC0_RD_RETRY_THRESHOLD_M  ((SLC_SLC0_RD_RETRY_THRESHOLD_V)<<(SLC_SLC0_RD_RETRY_THRESHOLD_S))
#define SLC_SLC0_RD_RETRY_THRESHOLD_V  0x7FF
#define SLC_SLC0_RD_RETRY_THRESHOLD_S  5
/* SLC_SLC0_RX_FILL_EN : R/W ;bitpos:[4] ;default: 1'b1 ; */
/*description: */
#define SLC_SLC0_RX_FILL_EN  (BIT(4))
#define SLC_SLC0_RX_FILL_EN_M  (BIT(4))
#define SLC_SLC0_RX_FILL_EN_V  0x1
#define SLC_SLC0_RX_FILL_EN_S  4
/* SLC_SLC0_RX_EOF_MODE : R/W ;bitpos:[3] ;default: 1'b1 ; */
/*description: */
#define SLC_SLC0_RX_EOF_MODE  (BIT(3))
#define SLC_SLC0_RX_EOF_MODE_M  (BIT(3))
#define SLC_SLC0_RX_EOF_MODE_V  0x1
#define SLC_SLC0_RX_EOF_MODE_S  3
/* SLC_SLC0_RX_FILL_MODE : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_RX_FILL_MODE  (BIT(2))
#define SLC_SLC0_RX_FILL_MODE_M  (BIT(2))
#define SLC_SLC0_RX_FILL_MODE_V  0x1
#define SLC_SLC0_RX_FILL_MODE_S  2
/* SLC_SLC0_INFOR_NO_REPLACE : R/W ;bitpos:[1] ;default: 1'b1 ; */
/*description: */
#define SLC_SLC0_INFOR_NO_REPLACE  (BIT(1))
#define SLC_SLC0_INFOR_NO_REPLACE_M  (BIT(1))
#define SLC_SLC0_INFOR_NO_REPLACE_V  0x1
#define SLC_SLC0_INFOR_NO_REPLACE_S  1
/* SLC_SLC0_TOKEN_NO_REPLACE : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: */
#define SLC_SLC0_TOKEN_NO_REPLACE  (BIT(0))
#define SLC_SLC0_TOKEN_NO_REPLACE_M  (BIT(0))
#define SLC_SLC0_TOKEN_NO_REPLACE_V  0x1
#define SLC_SLC0_TOKEN_NO_REPLACE_S  0

#define SLC_0_TXLINK_DSCR_REG          (DR_REG_SLC_BASE + 0x9C)
/* SLC_SLC0_TXLINK_DSCR : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define SLC_SLC0_TXLINK_DSCR  0xFFFFFFFF
#define SLC_SLC0_TXLINK_DSCR_M  ((SLC_SLC0_TXLINK_DSCR_V)<<(SLC_SLC0_TXLINK_DSCR_S))
#define SLC_SLC0_TXLINK_DSCR_V  0xFFFFFFFF
#define SLC_SLC0_TXLINK_DSCR_S  0

#define SLC_0_TXLINK_DSCR_BF0_REG          (DR_REG_SLC_BASE + 0xA0)
/* SLC_SLC0_TXLINK_DSCR_BF0 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define SLC_SLC0_TXLINK_DSCR_BF0  0xFFFFFFFF
#define SLC_SLC0_TXLINK_DSCR_BF0_M  ((SLC_SLC0_TXLINK_DSCR_BF0_V)<<(SLC_SLC0_TXLINK_DSCR_BF0_S))
#define SLC_SLC0_TXLINK_DSCR_BF0_V  0xFFFFFFFF
#define SLC_SLC0_TXLINK_DSCR_BF0_S  0

#define SLC_0_TXLINK_DSCR_BF1_REG          (DR_REG_SLC_BASE + 0xA4)
/* SLC_SLC0_TXLINK_DSCR_BF1 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define SLC_SLC0_TXLINK_DSCR_BF1  0xFFFFFFFF
#define SLC_SLC0_TXLINK_DSCR_BF1_M  ((SLC_SLC0_TXLINK_DSCR_BF1_V)<<(SLC_SLC0_TXLINK_DSCR_BF1_S))
#define SLC_SLC0_TXLINK_DSCR_BF1_V  0xFFFFFFFF
#define SLC_SLC0_TXLINK_DSCR_BF1_S  0

#define SLC_0_RXLINK_DSCR_REG          (DR_REG_SLC_BASE + 0xA8)
/* SLC_SLC0_RXLINK_DSCR : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define SLC_SLC0_RXLINK_DSCR  0xFFFFFFFF
#define SLC_SLC0_RXLINK_DSCR_M  ((SLC_SLC0_RXLINK_DSCR_V)<<(SLC_SLC0_RXLINK_DSCR_S))
#define SLC_SLC0_RXLINK_DSCR_V  0xFFFFFFFF
#define SLC_SLC0_RXLINK_DSCR_S  0

#define SLC_0_RXLINK_DSCR_BF0_REG          (DR_REG_SLC_BASE + 0xAC)
/* SLC_SLC0_RXLINK_DSCR_BF0 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define SLC_SLC0_RXLINK_DSCR_BF0  0xFFFFFFFF
#define SLC_SLC0_RXLINK_DSCR_BF0_M  ((SLC_SLC0_RXLINK_DSCR_BF0_V)<<(SLC_SLC0_RXLINK_DSCR_BF0_S))
#define SLC_SLC0_RXLINK_DSCR_BF0_V  0xFFFFFFFF
#define SLC_SLC0_RXLINK_DSCR_BF0_S  0

#define SLC_0_RXLINK_DSCR_BF1_REG          (DR_REG_SLC_BASE + 0xB0)
/* SLC_SLC0_RXLINK_DSCR_BF1 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define SLC_SLC0_RXLINK_DSCR_BF1  0xFFFFFFFF
#define SLC_SLC0_RXLINK_DSCR_BF1_M  ((SLC_SLC0_RXLINK_DSCR_BF1_V)<<(SLC_SLC0_RXLINK_DSCR_BF1_S))
#define SLC_SLC0_RXLINK_DSCR_BF1_V  0xFFFFFFFF
#define SLC_SLC0_RXLINK_DSCR_BF1_S  0

#define SLC_1_TXLINK_DSCR_REG          (DR_REG_SLC_BASE + 0xB4)
/* SLC_SLC1_TXLINK_DSCR : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define SLC_SLC1_TXLINK_DSCR  0xFFFFFFFF
#define SLC_SLC1_TXLINK_DSCR_M  ((SLC_SLC1_TXLINK_DSCR_V)<<(SLC_SLC1_TXLINK_DSCR_S))
#define SLC_SLC1_TXLINK_DSCR_V  0xFFFFFFFF
#define SLC_SLC1_TXLINK_DSCR_S  0

#define SLC_1_TXLINK_DSCR_BF0_REG          (DR_REG_SLC_BASE + 0xB8)
/* SLC_SLC1_TXLINK_DSCR_BF0 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define SLC_SLC1_TXLINK_DSCR_BF0  0xFFFFFFFF
#define SLC_SLC1_TXLINK_DSCR_BF0_M  ((SLC_SLC1_TXLINK_DSCR_BF0_V)<<(SLC_SLC1_TXLINK_DSCR_BF0_S))
#define SLC_SLC1_TXLINK_DSCR_BF0_V  0xFFFFFFFF
#define SLC_SLC1_TXLINK_DSCR_BF0_S  0

#define SLC_1_TXLINK_DSCR_BF1_REG          (DR_REG_SLC_BASE + 0xBC)
/* SLC_SLC1_TXLINK_DSCR_BF1 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define SLC_SLC1_TXLINK_DSCR_BF1  0xFFFFFFFF
#define SLC_SLC1_TXLINK_DSCR_BF1_M  ((SLC_SLC1_TXLINK_DSCR_BF1_V)<<(SLC_SLC1_TXLINK_DSCR_BF1_S))
#define SLC_SLC1_TXLINK_DSCR_BF1_V  0xFFFFFFFF
#define SLC_SLC1_TXLINK_DSCR_BF1_S  0

#define SLC_1_RXLINK_DSCR_REG          (DR_REG_SLC_BASE + 0xC0)
/* SLC_SLC1_RXLINK_DSCR : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define SLC_SLC1_RXLINK_DSCR  0xFFFFFFFF
#define SLC_SLC1_RXLINK_DSCR_M  ((SLC_SLC1_RXLINK_DSCR_V)<<(SLC_SLC1_RXLINK_DSCR_S))
#define SLC_SLC1_RXLINK_DSCR_V  0xFFFFFFFF
#define SLC_SLC1_RXLINK_DSCR_S  0

#define SLC_1_RXLINK_DSCR_BF0_REG          (DR_REG_SLC_BASE + 0xC4)
/* SLC_SLC1_RXLINK_DSCR_BF0 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define SLC_SLC1_RXLINK_DSCR_BF0  0xFFFFFFFF
#define SLC_SLC1_RXLINK_DSCR_BF0_M  ((SLC_SLC1_RXLINK_DSCR_BF0_V)<<(SLC_SLC1_RXLINK_DSCR_BF0_S))
#define SLC_SLC1_RXLINK_DSCR_BF0_V  0xFFFFFFFF
#define SLC_SLC1_RXLINK_DSCR_BF0_S  0

#define SLC_1_RXLINK_DSCR_BF1_REG          (DR_REG_SLC_BASE + 0xC8)
/* SLC_SLC1_RXLINK_DSCR_BF1 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: */
#define SLC_SLC1_RXLINK_DSCR_BF1  0xFFFFFFFF
#define SLC_SLC1_RXLINK_DSCR_BF1_M  ((SLC_SLC1_RXLINK_DSCR_BF1_V)<<(SLC_SLC1_RXLINK_DSCR_BF1_S))
#define SLC_SLC1_RXLINK_DSCR_BF1_V  0xFFFFFFFF
#define SLC_SLC1_RXLINK_DSCR_BF1_S  0

#define SLC_0_TX_ERREOF_DES_ADDR_REG          (DR_REG_SLC_BASE + 0xCC)
/* SLC_SLC0_TX_ERR_EOF_DES_ADDR : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: */
#define SLC_SLC0_TX_ERR_EOF_DES_ADDR  0xFFFFFFFF
#define SLC_SLC0_TX_ERR_EOF_DES_ADDR_M  ((SLC_SLC0_TX_ERR_EOF_DES_ADDR_V)<<(SLC_SLC0_TX_ERR_EOF_DES_ADDR_S))
#define SLC_SLC0_TX_ERR_EOF_DES_ADDR_V  0xFFFFFFFF
#define SLC_SLC0_TX_ERR_EOF_DES_ADDR_S  0

